tests/benchmark/results/wrk2_final/fork/c500.log
Running 15s test @ http://127.0.0.1:9534/hello
  4 threads and 500 connections
  Thread calibration: mean lat.: 1.598ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.551ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.491ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.728ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  39100 requests in 16.63s, 3.77MB read
  Socket errors: connect 0, read 0, write 0, timeout 3977
Requests/sec:   2351.87
Transfer/sec:    231.97KB